// export const emailRegexp = /^\w+([\.-]?\w+)*@\w+([\.-]?\w+)*(\.\w{2,3})+$/;

export const emailRegexp =
  /^(?:[a-zA-Z0-9!#$%&'*+/=?^_`{|}~-]+(?:\.[a-zA-Z0-9!#$%&'*+/=?^_`{|}~-]+)*|"[^"\\\r\n]*")@(?:(?:[a-zA-Z0-9](?:[a-zA-Z0-9-]{0,61}[a-zA-Z0-9])?\.)+[a-zA-Z]{2,}|(?:\[(?:(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\.){3}(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)]))$/;
/*  Що підтримує цей RegEx:
✅ Крапки та спецсимволи у локальній частині
✅ Імейли з лапками "..."
✅ IP-адреси в доменах (наприклад, user@[192.168.1.1])
✅ Підтримка багаторівневих доменів
✅ Уникає небезпечних ситуацій типу .. або .@
✅ Максимально відповідає RFC 5322
⚠️ Важливо:
Цей вираз досить довгий і важкий, тому краще не використовувати його на клієнтському JS без потреби.
У реальному житті, навіть якщо RegEx пройдено, справжню валідацію email краще робити ще й сервером + через відправку листа з підтвердженням.
 */

export const accessTokenLifeTime = 1000 * 60 * 15;

export const refreshTokenLifeTime = 1000 * 60 * 60 * 24;
